tap "gdubw/gng"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "certbot"
brew "docker-compose"
brew "entr"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "make"
brew "mosh"
brew "n"
brew "nghttp2"
brew "nginx", restart_service: true
brew "nmap"
brew "pipx"
brew "rust"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "gdubw/gng/gng"
cask "powershell"
