tap "homebrew/bundle"
brew "age"
brew "cmake"
brew "python@3.12"
brew "unbound"
brew "gnutls"
brew "colima"
brew "coreutils"
brew "docker-compose"
brew "doctl"
brew "fish"
brew "fswatch"
brew "ghostscript"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "hugo"
brew "imapsync"
brew "jq"
brew "just"
brew "llvm"
brew "make"
brew "mosh"
brew "mutt"
brew "nginx"
brew "nmap"
brew "node"
brew "oauth2_proxy"
brew "parallel"
brew "php"
brew "pnpm"
brew "pwgen"
brew "qrencode"
brew "runit"
brew "rust"
brew "sevenzip"
brew "shellcheck"
brew "tig"
brew "tmux"
brew "tree"
brew "unzip"
brew "uv"
brew "vim"
brew "wget"
cask "finicky"
cask "salt"
vscode "1yib.rust-bundle"
vscode "766b.go-outliner"
vscode "arthaud-proust.hugo-partials-defs"
vscode "austenc.tailwind-docs"
vscode "bar.python-import-helper"
vscode "be5invis.toml"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "blinkshellinc.blink-fs"
vscode "bmalehorn.shell-syntax"
vscode "bradlc.vscode-tailwindcss"
vscode "budparr.language-hugo-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "dachuiopensource.freemind"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hipdotmedia.hipdot-vs-code-url-scheme-grabber"
vscode "ivhernandez.vscode-plist"
vscode "janisdd.vscode-edit-csv"
vscode "jinliming2.vscode-go-template"
vscode "kaellarkin.hugo-shortcode-syntax"
vscode "kdcro101.favorites"
vscode "kevinrose.vsc-python-indent"
vscode "l13rary.l13-diff"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mgmeyers.markdown-writer-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "msyrus.go-doc"
vscode "nikolaosgeorgiou.html-fmt-vscode"
vscode "philipbe.theme-gray-matter"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "wholroyd.jinja"
vscode "windmilleng.vscode-go-autotest"
vscode "yzhang.markdown-all-in-one"
