tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "entr"
brew "fish"
brew "gdub"
brew "git"
brew "go"
brew "heroku"
brew "htop"
brew "hugo"
brew "make"
brew "nginx", restart_service: true
brew "nmap"
brew "packer"
brew "runit"
brew "rust"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
cask "vagrant"
cask "vagrant-manager"
