mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
sindresorhus/pure

belak/zsh-utils path:editor path:history path:utility

ptavares/zsh-direnv

~/.config/tastapod/dotfiles/zsh/functions kind:fpath

# TODO: use `envsubst` to use $ZSH_CUSTOM here
# https://github.com/mattmc3/antidote/discussions/75#discussioncomment-3685066
~/.local/share/zsh/functions kind:fpath

# TODO: figure out caching for this
#snailslug/autoupdate-antidote-zsh

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
