# core plugins
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# prompt
sindresorhus/pure

# these are nice
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup
#belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:utility

# enable direnv(1)
ptavares/zsh-direnv

# have zsh-bench available
romkatv/zsh-bench kind:path

# TODO: figure out caching for this
#snailslug/autoupdate-antidote-zsh

# Fish-like features
mattmc3/zfunctions                          # User functions (funced, funcsave)
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
